IDEA StatiCa Open Model
OpenModelClassAttribute Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Base attribute of the Open model
Inheritance Hierarchy
System.Object
 System.Attribute
 IdeaRS.OpenModel.OpenModelClassAttribute
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public sealed class OpenModelClassAttribute : Attribute
Public NotInheritable Class OpenModelClassAttribute
	Inherits Attribute
public ref class OpenModelClassAttribute sealed : public Attribute
The OpenModelClassAttribute type exposes the following members.
Constructors
Name | Description
OpenModelClassAttribute(String)
 Constructor
OpenModelClassAttribute(Type)
 Constructor
OpenModelClassAttribute(String, String)
 Constructor
OpenModelClassAttribute(String, Type)
 Constructor
OpenModelClassAttribute(String, String, Type)
 Constructor
Top
Properties
Name | Description
OpenModelListType
StructuralModelClassType
StructuralModelContainerType
Top
See Also
Reference
IdeaRS.OpenModel Namespace